src/InformationRegisters/СостояниеНоменклатуры/СостояниеНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеНоменклатуры</name>
  <comment>Описывает все возможные состояния номенклатуры</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Арендатор</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </resources>
  <resources>
    <name>Станция</name>
    <type>
      <types>CatalogRef.Станции</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеЭксплуатации</name>
    <comment>Пустая ссылка - все нормально, иначе см. основание</comment>
    <type>
      <types>EnumRef.ОснованияВыводаТовараИзЭксплуатации</types>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ПричиныПолученияБаллов/ПричиныПолученияБаллов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПричиныПолученияБаллов</name>
  <enumValues>
    <name>ЗаАренду</name>
  </enumValues>
  <enumValues>
    <name>ЗаИвент</name>
  </enumValues>
  <enumValues>
    <name>ПоРешениюСотрудника</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ОкончаниеАренды/ОкончаниеАренды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОкончаниеАренды</name>
  <registerRecords>InformationRegister.СостояниеНоменклатуры</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Станция</name>
    <type>
      <types>CatalogRef.Станции</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/ОплатаАренды/ОплатаАренды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаАренды</name>
  <registerRecords>AccumulationRegister.СтатистикаПользователей</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяАренды</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/ПолучениеБонусныхБаллов/ПолучениеБонусныхБаллов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПолучениеБонусныхБаллов</name>
  <registerRecords>AccumulationRegister.СтатистикаПользователей</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Причина</name>
    <type>
      <types>EnumRef.ПричиныПолученияБаллов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ивент</name>
    <type>
      <types>CatalogRef.Ивенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/НачалоАренды/НачалоАренды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачалоАренды</name>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
</mdclass:Document>

src/CommonForms/ЛКАренда/Module.bsl
#Если Не ВебКлиент Тогда
&НаКлиенте
Асинх Процедура Завершить(Команда)
	Для Каждого Идентификатор Из Элементы.СейчасАрендованы.ВыделенныеСтроки Цикл
		Товар = Элементы.СейчасАрендованы.ДанныеСтроки(Идентификатор).ТоварСсылка;
		Станция = Ждать ВвестиЗначениеАсинх(,"На какой станции закончить аренду " + Товар,Тип("СправочникСсылка.Станции"));
		ЗавершитьОдин(Товар, Станция);
	КонецЦикла;
	Элементы.СейчасАрендованы.Обновить();
КонецПроцедуры

&НаСервере
Процедура ЗавершитьОдин(Товар, Станция)
	ТекДата = ТекущаяДатаСеанса();
	ДатаНачала = РегистрыСведений.СостояниеНоменклатуры.СрезПоследних(ТекДата, Новый Структура("Товар",
		Товар))[0].Период;

	НачатьТранзакцию();
	Попытка
		Документ = Документы.ОкончаниеАренды.СоздатьДокумент();
		Документ.Клиент = Клиент;
		Документ.Товар = Товар;
		Документ.Дата = ТекДата;
		Документ.Станция = Станция;
		Документ.Записать(РежимЗаписиДокумента.Проведение);

		Документ = Документы.ОплатаАренды.СоздатьДокумент();
		Документ.Клиент = Клиент;
		Документ.Товар = Товар;
		Документ.Дата = ТекДата;

		Документ.ВремяАренды = Цел(ТекДата - ДатаНачала) / 60;
		Документ.Записать(РежимЗаписиДокумента.Проведение);
		ОплатаАренды = Документ.Ссылка;
		Бонус = Цел(ОплатаАренды.СуммаОплаты / 10);
		
		Если Бонус > 0 Тогда
		Документ = Документы.ПолучениеБонусныхБаллов.СоздатьДокумент();
		Документ.Причина = Перечисления.ПричиныПолученияБаллов.ЗаАренду;
		Документ.КоличествоБаллов = Бонус;
		Документ.Клиент = Клиент;
		Документ.Записать();
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьИзСписка1(Команда)
	Товар = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	Товар = Ждать ВвестиЗначениеАсинх(Товар, "Введите товар из списка.");

	Если ЗначениеЗаполнено(Товар) Тогда
		ВзятьВАренду();
	КонецЕсли;
КонецПроцедуры

// @strict-types
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Клиент = ПользователиВызовСервера.ТекущийКлиент();
	СейчасАрендованы.Параметры.УстановитьЗначениеПараметра("Арендатор", Клиент);
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВвестиАртикулИлиНаименование(Команда)
	Текст = Ждать ВвестиСтрокуАсинх(,"Введите артикул или часть наименования.");
	ОбработкаВвода(Текст);

	Если ЗначениеЗаполнено(Товар) Тогда
		Рез = Ждать ВопросАсинх("Подтвердить аренду товара " + Товар.Наименование + "?", РежимДиалогаВопрос.ОКОтмена);
		Если Рез = КодВозвратаДиалога.ОК Тогда
			ВзятьВАренду();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВзятьВАренду()
	Документ = Документы.НачалоАренды.СоздатьДокумент();
	Документ.Дата = ТекущаяДатаСеанса();
	Документ.Товар = Товар;
	Документ.Клиент = Клиент;
	Документ.Записать(РежимЗаписиДокумента.Проведение);
	Элементы.СейчасАрендованы.Обновить();
КонецПроцедуры

// Обрабатывает введенный пользователем текст, содержащий либо артикул, либо наименование товара.
// 
// Параметры:
//   Текст - Строка, Неопределено - Введенный текст.
&НаСервере
Процедура ОбработкаВвода(Текст)
	Если Текст = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Товар = Справочники.Номенклатура.НайтиПоКоду(Текст);

	Если Не ЗначениеЗаполнено(Товар) Тогда
		Товар = Справочники.Номенклатура.НайтиПоНаименованию(Текст);
	КонецЕсли;
КонецПроцедуры
#КонецЕсли
